{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v3.18.0",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 32,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "valid",
            "activation": "relu",
            "input_shape": [224, 224, 3]
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2],
            "strides": [2, 2],
            "padding": "valid"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "valid",
            "activation": "relu"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2],
            "strides": [2, 2],
            "padding": "valid"
          }
        },
        {
          "class_name": "Flatten",
          "config": {}
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 4,
            "activation": "softmax"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": []
    }
  ]
}
